// 立即执行函数，防止变量污染 (function() {})();
var value1 = [3000,14,30000,23700,18750,83600,24500,1139,551,14100,246,1200,23000,50000,47.8];
var value2 = [91,0.590,2,1.52,1.25,25.08,350,914,200,17,1.23,160,61,67,37.3];
var value3 = [30000,64239.1,80000,61600,50000,378600,130000,30000,1370,42500,1000,27640,38400,160000,108.9];
var value4 = [340,664.5,20,15.4,12.5,130,1000,1010,790,137,5,12,120,160,76.8];
var data1 = [
  [0.26, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00],
  [0.00, 0.00, 0.00, 0.00, 0.02, 0.14, 1.48, 4.09, 8.66],
  [0.52, 3.11, 2.27, 0.66, 0.10, 0.55, 1.03, 0.53, 0.20],
  [0.00, 0.00, 0.00, 0.00, 0.00, 0.03, 0.00, 0.00, 0.00],
  [0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.33],
  [5.25, 0.36, 0.10, 0.01, 0.00, 0.00, 0.00, 0.00, 0.00],
  [0.00, 0.11, 0.03, 0.04, 0.03, 0.00, 0.00, 0.00, 0.00],
  [0.76, 0.98, 0.99, 0.60, 0.39, 0.37, 0.35, 0.28, 0.27]
];
var data2 = [
  [0.71, 0.00, 0.00, 0.01, 0.01, 0.04, 0.00, 0.00, 0.00],
  [0.00, 0.00, 0.00, 0.00, 0.03, 0.43, 4.46, 15.04, 30.23],
  [0.92, 3.13, 2.27, 0.66, 0.10, 0.55, 1.05, 0.56, 0.22],
  [0.00, 0.00, 0.00, 0.00, 0.00, 0.40, 0.00, 0.00, 0.00],
  [0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 0.00, 7.28],
  [57.96, 3.54, 0.32, 0.09, 0.01, 0.00, 0.00, 0.00, 0.00],
  [0.08, 12.81, 3.37, 4.03, 2.75, 0.46, 0.11, 0.02, 0.00],
  [179.22, 449.36, 527.76, 505.85, 330.55, 353.71, 515.79, 486.26, 623.98]
];
var numb = [
  "支气管炎",
  "肺炎",
  "鼻炎",
  "咽喉炎",
  "胃炎",
  "急性肠炎",
  "高血压",
  "冠心病",
  "脑梗塞",
  "糖尿病",
  "阑尾炎",
  "胃溃疡",
  "肾结石",
  "痔疮",
  "胃癌",
  "鼠疫",
  "艾滋病",
  "狂犬病",
  "传染性非典型肺炎",
  "新冠肺炎",
  "白喉",
  "霍乱",
  "乙型病毒性肝炎"
];
var number1 = [
  "咳嗽、咳痰、气喘，还可能出现全身无力、低烧、畏寒",
  "寒战、高热、咳嗽、咳痰、胸痛、呼吸困难，还可能出现恶心、呕吐、腹胀、腹泻等胃肠道症状，严重感染者可能出现神志模糊、烦躁、嗜睡、昏迷等症状",
  "鼻塞、多涕、嗅觉下降、头痛和头昏，还可能出现全身症状，如头痛、食欲不振、易疲倦、记忆力减退和失眠等",
  "喉炎的主要临床表现为咽痛、异物感、音哑、灼热感和咳痰。重症患者可能会发冷、高烧，甚至不敢吞咽、发音困难",
  "胃痛、胃胀、反酸、恶心呕吐等症状。除此之外，患者还可能感到胃灼热等其他不适",
  "腹泻、腹痛、腹胀，并可能伴有不同程度的恶心和呕吐。在病情较为严重时，患者可能会出现脱水症状，如口渴、尿量减少、皮肤弹性下降等，甚至可能出现休克状态。此外，急性肠炎还可能导致食欲减退、发热和乏力等症状，对患者的生活和工作产生明显影响",
  "轻者可能无明显症状，仅在体检时发现血压升高。随着病情的发展，患者可能出现头晕、头痛、耳鸣、视物模糊、胸闷、心悸、气促等症状。此外，高血压还可能影响其他器官，导致恶心、呕吐、视力障碍、抽搐、昏迷等严重症状。长期高血压还可能引起靶器官损害，如高血压脑病、脑血管病、心血管病、高血压肾损害、眼底受损等",
  "胸痛、胸部压迫感和呼吸急促。随着病情的发展，胸痛可能变得更加频繁和严重，即使在安静状态下或夜间也可能出现。除了胸痛，患者还可能伴有虚脱、出汗、呼吸短促、忧虑、心悸、恶心或头晕等症状",
  "视物模糊、视野不全、发音困难、说话断断续续、烦躁不安、沉默寡言、表情淡漠、感到疲惫不堪，有嗜睡的表现，病情较严重时，患者可能会出现一侧肢体麻木、行动不便的症状，严重时可能不良于行，甚至导致大小便失禁",
  "血糖升高、多尿、口渴、饥饿感以及体重下降",
  "发热、腹痛、恶心、呕吐、腹泻等",
  "胃部疼痛，尤其是上腹部的疼痛。这种疼痛常表现为烧灼性、啮咬性或饥饿性钝痛、胀痛或隐痛，位置可能在剑突（心窝）下或上腹部中线周围。疼痛可能会持续半小时到三小时，并且具有间歇性，即在疼痛一段时间后会暂时缓解，但随后可能会再次出现。此外，胃溃疡患者还可能出现其他症状，如烧心、吐酸水、嗳气、食欲丧失、体重减轻、贫血，以及偶尔的呕吐。在某些情况下，胃溃疡还可能导致黑色或柏油样大便，这是消化道出血的迹象",
  "腰痛、血尿、排出砂石，长期无症状的肾结石也可能导致肾积水、肾功能受损等严重后果",
  "便血、痔脱出、疼痛与不适和瘙痒",
  "上腹部不适、饱胀感、食欲减退、恶心、呕吐，部分患者可能出现黑便或呕血，这是由于胃癌导致的消化道出血。长期出血还可能引起贫血",
  "寒战、高热、剧烈头痛、中枢性呕吐、呼吸急促、心动过速等症状",
  "急性期：发热、全身不适、头痛、恶心、咽痛、肌痛、关节痛及淋巴结肿大，无症状期：HIV仍在体内不断复制并破坏免疫系统，艾滋病期：免疫系统已遭受严重破坏，易感染各种疾病。常见症状包括持续发热、盗汗、厌食、体重下降、慢性腹泻以及易感冒等",
  "在初期，患者可能出现低热、头痛、全身乏力、恶心、烦躁和恐惧不安等症状。同时，被咬伤的伤口周围可能出现麻木、痒痛等异常感觉。随着病情的发展，患者进入兴奋期，表现出极度恐惧、恐水、怕风、咽肌痉挛、呼吸困难等症状。此外，患者还可能出现全身疼痛性抽搐，甚至昏迷。整个病程通常不超过一周，最终可能导致患者死亡",
  "发热并可能伴有畏寒、肌肉及关节酸痛、头痛、乏力等症状，呼吸道症状有咳嗽，多为干咳、少痰，部分患者可能出现血丝痰，严重者可能出现呼吸困难、气促等症状，部分患者可能出现腹泻、恶心、呕吐等消化系统相关症状",
  "主要症状包括发热、干咳、乏力等，部分患者可能出现鼻塞、流涕、咽痛、腹泻等症状。重症患者可能出现呼吸急促或呼吸困难，甚至出现急性呼吸窘迫综合征、脓毒症休克、难以纠正的代谢性酸中毒和出凝血功能障碍等。需要注意的是，部分患者可能仅表现为低热、轻微乏力等，而无肺炎表现",
  "发热、呼吸困难、声音改变、咽喉疼痛，对于严重的病例，患者可能表现出全身中毒症状，如乏力、恶心、呕吐等，甚至可能出现心肌炎和周围神经麻痹等并发症",
  "腹泻、呕吐、脱水，由于腹泻、呕吐使大量的钠盐丧失，严重的低血钠引起腓肠肌和腹直肌痉挛，临床表现为肌肉疼痛或呈强直状态",
  "分为急性、慢性、重度乙型病毒性肝炎，都有严重的症状产生"
];
var number2 = [
  "<p>1.积极锻炼，提升身体素质</p><p>2.饮食护理，如多食水果和蔬菜</p><p>3.减少呼吸道刺激，如戒烟</p><p>4.增强体质</p>",
  "<p>1.注意通风：保持室内空气流通，避免在密闭环境中生活</p><p>2.增强体质：适当参加户外活动，增强自身体质和免疫力</p><p>3.避免诱因：减少吸入刺激性气体，戒烟戒酒，避免到人群密集的地方，以预防病原体入侵</p>",
  "<p>1.积极锻炼，提升身体素质</p><p>2.饮食护理，如多食水果和蔬菜</p><p>3.注意卫生：由于鼻炎具有一定的传染性，外出时及时佩戴口罩，避免病原体通过呼吸道飞沫传播</p>",
  "<p>1.积极锻炼，提升身体素质</p><p>2.避免不良习惯：要避免抽烟和喝酒，酒精和香烟烟雾会刺激咽喉黏膜，容易诱发咽喉炎</p><p>3.养成良好生活习惯：保持规律的作息时间，避免熬夜，并尽量不过度饮食</p><p>4.保持空气湿度：在秋冬季等干燥季节，应保持居住环境的空气湿度，可以使用加湿器来增加空气湿度</p>",
  "<p>1.饮食应有节制，定时定量，避免暴饮暴食，尽量选择富有营养、易消化的食物，如含植物蛋白和维生素多的食物。</p><p>2.应避免摄入过硬、过辣、过咸、过热、过分粗糙和刺激性强的食物，以及戒烟限酒</p><p>3.精神紧张也可能是慢性胃炎的诱发因素，因此应避免过度劳累和情绪波动。</p>",
  "<p>1.避免摄入被污染的食物和水源，特别是在公共卫生欠佳的地区</p><p>2.合理使用抗生素，避免滥用，以免破坏肠道菌群平衡而诱发肠炎</p><p>3.保持良好的生活习惯，如规律作息、适度锻炼等，也有助于增强身体免疫力，预防急性肠炎的发生</p>",
  "<p>1.保持健康的生活方式：饮食上要低盐、低脂、低糖，多吃蔬菜水果和富含纤维的食物。适量运动，保持体重在正常范围内，避免过度劳累和熬夜</p><p>2.管理好慢性疾病：慢性疾病如糖尿病、高血脂等都可能导致高血压的发生，对这些疾病的管理和控制，可以降低高血压的患病风险</p>",
  "<p>1.一级预防：针对危险因素进行干预，包括戒烟、避免大量饮酒、注意锻炼身体、积极治疗高血压和糖尿病等慢性疾病</p><p>2.二级预防：在疾病发生后，通过药物和非药物措施防止病情恶化，非药物措施与一级预防相似，药物措施则包括使用降脂药、抗血小板抑制剂、β-受体阻滞剂等来稳定病情。</p>",
  "<p>1.改善饮食习惯：保持低盐低脂的饮食，多吃新鲜绿叶蔬菜，少吃腌制食物和油腻食物</p><p>2.保持良好心态：避免大喜大悲，学会释放自身压力以及不良情绪</p><p>3.规律生活：早睡早起，避免熬夜，戒烟酒，多进行户外运动，增强自身抵抗力</p><p>4.积极治疗原发病：如高血压、糖尿病等，应积极配合医生治疗，避免病情恶化导致脑梗塞</p>",
  "<p>1.控制饮食：肥胖患者发生糖尿病的风险更高，因此日常饮食应以低脂肪、适量蛋白质和碳水化合物为主，多摄入高纤维食物，尽量保持饮食清淡，并坚持少量多餐</p><p>2.血糖监测：有糖尿病风险的患者应定期监测血糖，一旦出现血糖高的现象，应及时通过饮食和运动稳定血糖</p>",
  "<p>1.合理饮食：以清淡易消化的食物为主，避免大量进食辛辣、油腻和刺激性食物</p><p>2.注意休息：避免过度劳累和做重体力劳动，以免增加腹压，导致阑尾炎反复发作</p><p>3.注意卫生：饭前便后要洗手，细嚼慢咽，避免暴饮暴食</p>",
  "<p>1.规律饮食：保持规律的饮食习惯，定时定量进餐，避免暴饮暴食，以减轻胃部负担</p><p>2.戒烟限酒：戒烟限酒可以减少胃黏膜的损伤，降低胃溃疡的发生风险</p><p>3.定期检查：定期进行胃镜检查可以及时发现并治疗胃溃疡，防止病情恶化</p>",
  "<p>1.保持充足的水分摄入</p><p>2.调整饮食：适量增加纤维素摄入，如米糠等，有助于防止结石形成。同时，控制钙的摄取量，避免过量摄入高钙食物，如牛奶、干酪等</p><p>3.补充维生素A：维生素A有助于维持尿道内膜健康，阻碍结石复发</p>",
  "<p>1.饮食调整：保持食物纤维的摄入，节制辛辣、刺激性强的食品，如酒、辣椒等，以预防大便干燥和诱发痔疮</p><p>2.良好排便习惯：建议每天清晨起床后或早餐后排便，并尽量缩短排便时间，避免久蹲和看书等分散注意力的行为</p>",
  "<p>1.健康饮食</p><p>2.定期体检：定期进行胃镜检查，有助于早期发现胃癌或癌前病变，从而提高治愈率</p><p>3.控制胃部疾病：积极治疗慢性胃炎、胃溃疡等胃部疾病，降低胃癌的发病风险</p>",
  "<p>1.加强疫情报告，严格隔离病人和疑似患者，分别进行隔离观察</p><p>2.加强疫源地的监测，不仅关注鼠间鼠疫的情况，还要监测鼠疫宿主和媒介的密度变化</p><p>3.切断传播途径至关重要，包括加强国际检疫和交通检疫，对来自疫区的车、船、飞机进行严格检疫并灭鼠灭蚤，对可疑旅客应隔离检疫</p>",
  "<p>1.安全性行为：洁身自好，避免滥交，正确使用安全套，拒绝不安全的性行为</p><p>2.个人防护：避免与艾滋病感染者的血液、精液、乳汁和尿液接触，特别是在艾滋病流行地区</p><p>3.及时阻断：发生高危行为后，应尽早使用艾滋病阻断药物</p><p>4.拒绝毒品：不共用针具，避免静脉注射毒品</p>",
  "<p>1.感染了狂犬病毒的动物，应单独饲养，避免与其他动物接触</p><p>2.如果被动物咬伤，应立即用肥皂水清洗伤口，并尽快接种人用狂犬疫苗</p>",
  "<p>1.疫情报告与隔离：发现或怀疑本病时，应尽快向卫生防疫机构报告，对确诊或疑似病例进行隔离治疗，并对密切接触者进行医学观察和隔离</p><p>2.切断传播途径：减少大型集会或活动，保持公共场所通风换气、空气流通；保持良好的个人卫生习惯，如勤洗手、避免去人多或相对密闭的地方，并注意戴口罩</p><p>3.保护易感人群：保持乐观稳定的心态，均衡饮食，多喝汤饮水，注意保暖，避免疲劳，适量运动等，以增强身体抵抗力</p>",
  "<p>1.个人防护：保持良好的个人卫生习惯，如勤洗手、戴口罩等，尽量避免前往人群密集的场所</p><p>2.接种疫苗：积极接种新冠疫苗，这是预防新冠肺炎的有效手段</p><p>3.保持社交距离：与他人保持一定的距离，尤其是与有症状或疑似感染的人保持距离</p><p>4.加强锻炼与饮食调理：适度的锻炼可以提高身体免疫力，而均衡的饮食也有助于增强抵抗力</p>",
  "<p>1.早期发现和隔离治疗：对于白喉患者，应尽早发现、隔离并治疗，以防止疾病的传播。同时，对密切接触者进行观察和检疫，通常需要观察7天</p><p>2.免疫接种：对于未接受过白喉类毒素全程免疫的幼儿，建议进行免疫接种，以提高机体免疫力，预防白喉的发生</p><p>3.切断传播途径：对患者接触过的物品和分泌物进行消毒灭菌，以切断白喉的传播途径</p><p>4.提高易感人群免疫力：对于易感人群，如学龄前儿童，应进行百白破三联疫苗的预防接种</p>",
  "<p>1.控制传染源：对疑似患者应及时进行隔离和治疗，避免病毒的传播。对接触者进行检疫，并采取预防措施，如服用预防药物等</p><p>2.切断传播途径：加强水源管理和粪便管理，避免粪便污染水源和食物。此外，应注意个人卫生，养成勤洗手、不随地吐痰等良好习惯</p><p>3.提高人群免疫力：虽然疫苗已经不作为常规应用，但新型基因疫苗的研究可能为预防霍乱提供新的手段</p>",
  "<p>1.控制传染源：对急性乙肝患者应进行隔离处理，避免传染给他人。慢性乙肝患者和乙肝携带者应避免献血和从事可能传播病毒的工作，如餐饮行业和幼托工作</p><p>2.切断传播途径：接触患者后应使用肥皂和流动水洗手，严格执行消毒制度。对血制品进行相应检测，预防医源性传播</p><p>3.保护易感人群：接种乙肝疫苗是预防乙肝感染的最有效方法</p>"
];
var number3 = [
  "<p>对症治疗：给予止咳化痰的药物、解热镇痛药以及平喘药等；</p><p>抗生素治疗：仅在存在感染证据的情况下使用，根据感染的病菌种类选择相应的抗生素；</p><p>一般治疗：包括嘱患者多休息、多饮水，避免劳累，以促进疾病的快速恢复</p>",
  "<p>抗菌药物治疗：对于细菌性肺炎，常用抗菌药物如头孢克肟胶囊、阿莫西林胶囊进行治疗</p><p>抗病毒药物治疗：对于病毒性肺炎，可使用抗病毒类药物如阿昔洛韦片、更昔洛韦分散片进行治疗</p><p>解热镇痛治疗：对于伴随发热和肌肉酸痛的患者，可使用解热镇痛药物如布洛芬缓释胶囊、对乙酰氨基酚片进行治疗</p>",
  "<p>药物治疗：根据鼻炎的类型和病因，选择适当的药物进行治疗。例如，抗病毒药物如利巴韦林滴鼻液可用于治疗病毒感染引起的鼻炎；抗生素如阿莫西林胶囊可用于治疗细菌感染引起的鼻炎；激素类药物如布地奈德鼻喷雾剂可用于治疗激素分泌异常引起的鼻炎</p><p>手术治疗：对于严重的鼻炎，如果保守治疗无效，可以考虑手术治疗，如选择性神经切断术或下鼻甲黏膜下部分切除术等</p>",
  "<p>保守治疗：主要涉及改变饮食习惯，如避免食用辛辣刺激的食物，少喝浓茶和咖啡，戒烟戒酒，并注意休息。</p><p>药物治疗：根据病因进行，如抗病毒、抗菌或抗过敏药物的应用。中药对咽喉炎的治疗也能取得良好效果，包括口服液、含片等。</p>",
  "<p>药物治疗：常用的药物包括保护胃黏膜药（如胶体次枸橼酸铋、硫糖铝等）、调整胃肠运动功能药物（如多潘立酮等）、抗生素（如克拉霉素、羟氨苄青霉素等，用于清除幽门螺杆菌）、制酸剂（如西咪替丁、雷尼替丁等）以及止痛药（如阿托品、普鲁本辛等）</p><p>生活方式调整：饮食、作息、心态等多方面的综合调整，以减轻胃部负担，促进胃炎的康复。</p>",
  "<p>一般治疗：卧床休息、调整饮食，如少食多餐、食用流质食物等，以保持体内水电解质的平衡；</p><p>西药治疗：采用消炎、止吐、止泻等药物来缓解症状，必要时可采用注射治疗；</p><p>中医治疗：采用中成药或中药汤剂进行治疗，如黄连素等，具有清热解毒、止泻止痛的功效；</p><P>按时服药，注意病情变化，如出现严重脱水或休克等症状，应及时就医进行输液等治疗</p>",
  "<p>非药物治疗：调整饮食、控制体重、适当运动等方式来调整血压。患者应调整饮食结构，低盐低脂饮食，多吃青菜水果和富含钙质的食物。同时，患者应适当的运动，控制体重，有利于改善人体的内分泌和神经系统</p><p>药物治疗：常用的药物包括钙拮抗剂、β受体阻滞剂、血管紧张素转换酶抑制剂和血管紧张素II受体拮抗剂</p>",
  "<p>内科治疗：调整生活方式，如合理饮食、适量体力活动、增强体质、纠正血脂、血压、血糖异常等</p><p>介入治疗：主要针对药物治疗不能控制的冠心病患者，包括经皮腔内冠状动脉成形术、冠状动脉内斑块旋切术、冠状动脉支架安置术等</p><p>外科治疗：冠状动脉搭桥手术，适用于左冠状动脉主干狭窄、冠状血管多支病变等复杂情况</p><p>手术治疗：体外循环下冠状动脉旁路移植术是常用的方法</p>",
  "<p>原发病治疗：根据医生的指导，对心血管疾病、脑部肿瘤等可能引起脑梗的原发病进行治疗</p><p>药物治疗：使用阿托伐他汀、氯吡格雷等药物，帮助改善脑血管循环</p><p>介入治疗：如颅内外血管经皮腔内血管成形术、血管内支架置入等，恢复血管正常运行</p><p>手术治疗：根据病情，可能需要进行开颅减压术、部分脑组织切除术或颈动脉内膜切除术等</p><p>中医治疗：如针灸、中草药物等，也是治疗脑梗塞的辅助手段</p>",
  "<p>饮食控制：这是糖尿病治疗的基础，应形成良好的饮食习惯，使血糖处于平稳状态</p><p>运动治疗：适量运动有助于减轻体重，改善胰岛素抵抗</p><p>药物治疗：主要有口服降糖药物和胰岛素治疗，应在医生指导下选择最合适的药物</p><p>糖尿病教育：患者及家属应学习、了解糖尿病及其并发症相关知识，提高自我管理的意识及能力</p>",
  "<p>药物治疗：适用于单纯性阑尾炎、急性阑尾炎的早期阶段或有手术禁忌的患者。主要使用抗生素和补液药物进行保守治疗</p><p>手术治疗：分为传统开腹手术和微创腹腔镜手术，可根据患者的具体病情和医生建议选择。手术治疗不仅能减轻患者的病痛，还能减少近期或远期并发症</p>",
  "<p>药物治疗：主要使用如抑酸剂（如雷尼替丁、奥美拉唑等）、胃黏膜保护剂（如硫糖铝）以及针对幽门螺杆菌感染的抗生素（如克拉霉素、甲硝唑等）。具体用药需在医生的指导下进行</p><p>手术治疗：大多数胃溃疡患者不需要手术治疗，但对于出现大量出血、急性穿孔、慢性穿透性溃疡、瘢痕性幽门梗阻或怀疑癌变的患者，可能需要进行手术治疗</p>",
  "<p>药物治疗：主要适用于较小的结石或症状较轻的患者，通过药物促进结石的溶解或排出</p><p>手术治疗：对于较大或症状严重的结石，可能需要采用手术治疗。手术方法包括体外冲击波碎石术、经输尿管镜碎石取石术、经皮肾镜取石术和腹腔镜切开取石术等。具体手术方法的选择应根据患者的具体情况和医生的建议来确定</p>",
  "<p>药物治疗：局部用药如痔疮膏栓、静脉血管活性药物等是常见的药物治疗方式，同时也可辅助以口服药物治疗</p><p>注射治疗：主要用于治疗轻度出血性的内痔，通过注射硬化剂使曲张的静脉压闭</p><p>胶圈套扎：主要用于治疗II、III度内痔，通过套扎痔的根部来阻断其血供，导致痔脱落坏死</p><p>手术治疗：对于保守治疗无效或病情严重的痔疮，如纤维化内痔较大、合并肛裂等，可能需要进行手术治疗，如混合痔外剥内扎术等</p>",
  "<p>手术治疗：对于早期胃癌患者，手术是首选的治疗方法。根据肿瘤的大小和位置，可能选择局部切除或全胃切除等手术方式</p><p>药物治疗：包括化疗、靶向治疗等，旨在杀灭或抑制肿瘤细胞的生长，提高患者的生存率</p><p>其他辅助治疗：如放疗、免疫治疗等，可作为手术治疗或药物治疗的辅助手段，提高治疗效果</p>",
  "<p>隔离治疗：确诊或疑似患者应迅速组织严密的隔离，就地治疗，避免转送</p><p>病原治疗：是早期联合使用敏感的抗菌药物</p><p>症治疗方面：高热患者需采取物理降温措施，疼痛或烦躁不安者可使用镇静止痛药，同时注意保护重要脏器功能。对于心力衰竭或休克的患者，需及时采取强心和抗休克治疗</p>",
  "<p>一般治疗：进行适当的隔离治疗，根据病情及患者意愿进行抗病毒治疗，并密切监测病情变化</p><p>支持治疗：注意休息，给予高热量、多维生素饮食。不能进食者，应静脉输液补充营养。加强支持疗法，包括输血及营养支持疗法，维持水及电解质平衡</p><p>药物治疗：高效抗反转录病毒治疗（HAART）是艾滋病最重要的治疗方法，可以抑制艾滋病毒的复制，重建或维持免疫功能。患者需在医生指导下服用相关药物</p>",
  "<p>狂犬病的治疗手段相对有限，一旦发病，治愈的可能性较低。因此，强调预防的重要性</p>",
  "<p>营养支持与水电解质平衡：确保患者获得足够的营养，维持水电解质和酸碱平衡</p><p>对症治疗：针对咳嗽、高热等症状进行相应治疗，如使用镇咳药、祛痰药、解热镇痛药等</p><p>重症病例处理：对于重症病例，需要严密动态观察，加强监护，及时给予呼吸支持，合理使用糖皮质激素，并处理并发症</p>",
  "<p>药物治疗：对于轻症患者，可能采用抗病毒药物进行治疗，如干扰素、阿比朵尔等。同时，也会使用一些抗菌药物来对抗可能合并的细菌感染</p><p>呼吸支持治疗：对于重症患者，如出现呼吸急促、呼吸困难等症状，需要及时采取呼吸支持疗法，如使用呼吸机辅助呼吸，以改善缺氧状况</p>",
  "<p>白喉的治疗主要依赖于药物治疗，常用药物包括青霉素G和抗毒素</p>",
  "<p>急性期治疗：患者应进行严格隔离，对排泄物彻底消毒。脱水患者应进行补液，可口服补液盐或通过静脉补液，并严密监测生命体征</p><p>药物治疗：抗菌治疗如使用环丙沙星、多西环素等药物可降低腹泻频率，清除粪便中的病原菌。同时，可以使用止泻药物如氯丙嗪、黄连素等。对症治疗包括针对严重低钾血症、急性肾水肿、心力衰竭等情况的治疗</p><p>其他治疗：如急性肾衰竭如有必要可进行透析治疗。同时，患者需要多喝水，补充体内所需的维生素和富含钾元素的食物</p>",
  "<p>抗病毒治疗：主要使用干扰素和核苷酸类似物，这些药物能够调节机体免疫杀伤感染靶细胞，阻断DNA合成，从而抑制乙型肝炎病毒的复制，减轻肝细胞损害，防止肝硬化</p><p>中医中药治疗：如使用苦参素等中药制剂，具有抗病毒作用</p><p>免疫调节治疗：如使用胸腺肽a1，它可以增强非特异性免疫功能，适用于某些不能耐受或不愿接受其他抗病毒治疗的患者</p><p>保肝降酶退黄治疗：针对肝脏炎症坏死及其所致的肝纤维化进行治疗，以有效抑制肝组织炎症</p>"
];
// 树图模块1
(function TreeChart() {
  // 1.实例化对象
  var myChart = echarts.init(document.querySelector(".tree .chart"));
  // 2.指定配置项和数据
  var data = {
    "name": "常见病型",
    "children": [
      {
        "name": "内科疾病",
        "children": [
          { "name": numb[0] },
          { "name": numb[1] },
          { "name": numb[2] },
          { "name": numb[3] },
          { "name": numb[4] },
          { "name": numb[5] },
          { "name": numb[6] },
          { "name": numb[7] },
          { "name": numb[8] },
          { "name": numb[9] }
        ]
      },
      {
        "name": "外科疾病",
        "children": [
          { "name": numb[10] },
          { "name": numb[11] },
          { "name": numb[12] },
          { "name": numb[13] },
          { "name": numb[14] }
        ]
      },
      {
        "name": "传染科疾病",
        "children": [
          { "name": numb[15] },
          { "name": numb[16] },
          { "name": numb[17] },
          { "name": numb[18] },
          { "name": numb[19] },
          { "name": numb[20] },
          { "name": numb[21] },
          { "name": numb[22] }
        ]
      },
    ]
  };

  var option = {
    tooltip: [
      {
        trigger: "item",
      }
    ],
    series: [
      {
        type: 'tree',
        id: 0,
        name: 'tree1',
        data: [data],

        top: '5%',
        left: '7%',
        bottom: '5%',
        right: '15%',

        symbolSize: 7,

        edgeShape: 'curve',//控制是否为折线
        edgeForkPosition: '63%',
        initialTreeDepth: 3,

        lineStyle: {
          width: 2
        },

        label: {
          margin: 30,
          color: 'rgb(255,190,122)',
          fontSize: 15,
          position: 'top',
          verticalAlign: 'middle',
          align: 'right'
        },
        leaves: {
          label: {
            fontSize: 15,
            color: 'rgb(190,184,220)',
            position: 'right',
            verticalAlign: 'middle',
            align: 'left'
          }
        },
        //节点设置为小圆点
        symbol: 'circle',
        // 设置节点大小
        symbolSize: 10,
        emphasis: {
          focus: 'descendant'
        },
        itemStyle: {
          color: "#ffeb7b",
          borderColor: "rgba(221, 220, 107, .1)",
          borderWidth: 12
        },
        expandAndCollapse: true,
        animationDuration: 550,
        animationDurationUpdate: 750
      }
    ]
  };
  // 3.把配置项给实例对象
  myChart.setOption(option, true);

  // 4.让图表随屏幕自适应
  window.addEventListener('resize', function () {
    myChart.resize();
  })


  myChart.on("click", function (params) {
    if (params.event.target.culling === true) {
      return;
    }
    if (params.event.target.culling === false) {
      for (var i = 0; i < 23; i++) {
        if (params.name == numb[i]) {
          document.getElementById("Name").innerHTML = params.name;
          document.getElementById("title1").innerHTML = "临床表现";
          document.getElementById("performance").innerHTML = number1[i];
          document.getElementById("title2").innerHTML = "预防措施";
          document.getElementById("measure").innerHTML = number2[i];
          document.getElementById("title3").innerHTML = "治疗途径";
          document.getElementById("treatment").innerHTML = number3[i];
          var myChart1 = echarts.init(document.querySelector(".line .chart"));
          function updateChart(option) {
            // 清除之前的图表配置（如果有的话）  
              myChart1.clear();
            // 设置新的图表配置  
            myChart1.setOption(option);
          }
          if (i > 14) {
            var option1 = {
              title: {
                text: '国内该病数据查询',
                left: 'center',
                textStyle:{
                  color: '#fff'
                }
              },
              tooltip: {
                trigger: 'axis',
              },
              legend: {
                top: "10%",
                textStyle: {
                  color: "rgba(255,255,255,.5)",
                  fontSize: "12"
                }
              },
              grid: {
                top: '50',
                left: '20',
                right: '30',
                bottom: '8',
                containLabel: true
              },
              xAxis: [{
                type: 'category',
                boundaryGap: false,
                // 文本颜色为rgba(255,255,255,.6)  文字大小为 12
                axisLabel: {
                  textStyle: {
                    color: "rgba(255,255,255,.6)",
                    fontSize: 12
                  }
                },
                // x轴线的颜色为   rgba(255,255,255,.2)
                axisLine: {
                  lineStyle: {
                    color: "rgba(255,255,255,.2)"
                  }
                },
                data: ["1950-1975", "1980-1984", "1985-1989", "1990-1994", "1995-1999", "2000-2004", "2005-2009", "2010-2014", "2015-2021"]
              }],
              yAxis: [{
                type: 'value',
                axisTick: {
                  // 不显示刻度线
                  show: false
                },
                axisLine: {
                  lineStyle: {
                    color: "rgba(255,255,255,.1)"
                  }
                },
                axisLabel: {
                  textStyle: {
                    color: "rgba(255,255,255,.6)",
                    fontSize: 12
                  }
                },
                // 修改分割线的颜色
                splitLine: {
                  lineStyle: {
                    color: "rgba(255,255,255,.1)"
                  }
                }
              }],
              series: [{
                name: '死亡率（1/10万）',
                type: 'line',
                smooth: true, // 圆滑的线
                // 单独修改当前线条的样式
                lineStyle: {
                  color: "#0184d5",
                  width: 2
                },
                // 填充区域渐变透明颜色
                areaStyle: {
                  color: new echarts.graphic.LinearGradient(
                    0,
                    0,
                    0,
                    1,
                    [{
                      offset: 0,
                      color: "rgba(1, 132, 213, 0.4)" // 渐变色的起始颜色
                    },
                    {
                      offset: 0.8,
                      color: "rgba(1, 132, 213, 0.1)" // 渐变线的结束颜色
                    }
                    ],
                    false
                  ),
                  shadowColor: "rgba(0, 0, 0, 0.1)"
                },
                // 拐点设置为小圆点
                symbol: 'circle',
                // 设置拐点大小
                symbolSize: 5,
                // 开始不显示拐点， 鼠标经过显示
                showSymbol: false,
                // 设置拐点颜色以及边框
                itemStyle: {
                  color: "#0184d5",
                  borderColor: "rgba(221, 220, 107, .1)",
                  borderWidth: 12
                },
                data: data1[i-15]
              },
              {
                name: "发病率（1/10万）",
                type: "line",
                smooth: true,
                lineStyle: {
                  normal: {
                    color: "#00d887",
                    width: 2
                  }
                },
                areaStyle: {
                  normal: {
                    color: new echarts.graphic.LinearGradient(
                      0,
                      0,
                      0,
                      1,
                      [{
                        offset: 0,
                        color: "rgba(0, 216, 135, 0.4)"
                      },
                      {
                        offset: 0.8,
                        color: "rgba(0, 216, 135, 0.1)"
                      }
                      ],
                      false
                    ),
                    shadowColor: "rgba(0, 0, 0, 0.1)"
                  }
                },
                // 设置拐点 小圆点
                symbol: "circle",
                // 拐点大小
                symbolSize: 5,
                // 设置拐点颜色以及边框
                itemStyle: {
                  color: "#00d887",
                  borderColor: "rgba(221, 220, 107, .1)",
                  borderWidth: 12
                },
                // 开始不显示拐点， 鼠标经过显示
                showSymbol: false,
                data: data2[i-15]
              }
              ]
            }
            updateChart(option1);
          } else {
            var option2 = {
              title: {
                text: '国内外该病数据（单位：万人）',
                textStyle:{
                  color:"#fff"
                },
                left: 'center'
              },
              tooltip: {
                trigger: 'item'
              },
              legend: {
                orient: 'horizontal',
                top: 'bottom',
                textStyle:{
                  color:'rgb(190,184,220)'
                }
              },
              series: [
                {
                  type: 'pie',
                  radius: '50%',
                  data: [
                    { value: value1[i], name: '患病人数（国内）'},
                    { value: value2[i], name: '死亡人数（国内）'},
                    { value: value3[i], name: '患病人数（全球）'},
                    { value: value4[i], name: '死亡人数（全球）'},
                  ],
                  label:{
                    color:'rgb(255,190,122)'
                  },
                  emphasis: {
                    itemStyle: {
                      shadowBlur: 10,
                      shadowOffsetX: 0,
                      shadowColor: 'rgba(0, 0, 0, 0.5)'
                    }
                  }
                }
              ]
            };
            updateChart(option2);
          }
          window.addEventListener('resize', function () {
            myChart1.resize();
          })
        }
      }
    }
  });
})();